## Pandas Join() Method in the Machine Learning

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A':[1,2,3],'B':[10,20,30]})
df1

   A   B
0  1  10
1  2  20
2  3  30

In [6]:
df2 = pd.DataFrame({'C':[4,5,6],'D':[40,50,60]})
df2

   C   D
0  4  40
1  5  50
2  6  60

In [7]:
display(df1,df2)

   A   B
0  1  10
1  2  20
2  3  30

   C   D
0  4  40
1  5  50
2  6  60

In [8]:
df1.join(df2)

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [9]:
df2.join(df1)

   C   D  A   B
0  4  40  1  10
1  5  50  2  20
2  6  60  3  30

In [14]:
df2.join(df2, how='right', lsuffix='_left', rsuffix='_right')

   C_left  D_left  C_right  D_right
0       4      40        4       40
1       5      50        5       50
2       6      60        6       60

In [15]:
df1.join(df2,rsuffix='_1')

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60